---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundary
source: html/f4275768-e9d5-fe68-621e-4f56c30a6cd0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundary Property

Stairs require no less than two boundaries (chains of one or more Boundary Lines)."

## Syntax (C#)
```csharp
public static FailureDefinitionId StairOnlyOneConnectedBoundary { get; }
```